MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DX128VLK7/mcu.h
#define REVID                         0x00078000      // Device revision number
#define FAMID                         0x000001C0      // Kinetis family identification
#define PINID                         0x00000078      // Pincount identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC1 register.
//
//*****************************************************************************

#define Reserved                      0x01000000      // 
#define Reserved                      0x01800000      // 
#define Reserved                      0x00200000      // 
#define Reserved                      0x1FF00000      // 
#define Reserved                      0x00000800      // 
#define Reserved                      0x00000400      // 
#define Reserved                      0x00000600      // 
#define Reserved                      0x00000080      // 
#define Reserved                      0x00000040      // 
#define Reserved                      0x000007E0      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC2 register.
//
//*****************************************************************************

#define Reserved                      0x00002000      // 
#define DAC0                          0x00001000      // DAC0 Clock Gate Control
#define Reserved                      0x003FF800      // 
#define Reserved                      0x00000001      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC3 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // 
#define Reserved                      0x40000000      // 
#define Reserved                      0x60000000      // 
#define ADC1                          0x08000000      // ADC1 Clock Gate Control
#define Reserved                      0x04000000      // 
#define Reserved                      0x02000000      // 
#define FTM2                          0x01000000      // FTM2 Clock Gate Control
#define Reserved                      0x1F800000      // 
#define Reserved                      0x00020000      // 
#define Reserved                      0x000F0000      // 
#define Reserved                      0x00001000      // 
#define Reserved                      0x0003F800      // 
#define Reserved                      0x00000010      // 
#define Reserved                      0x00000038      // 
#define Reserved                      0x00000001      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define Reserved                      0x780000000      // 
#define Reserved                      0x3F8000000      // 
#define VREF                          0x00100000      // VREF Clock Gate Control
#define CMP                           0x00080000      // Comparator Clock Gate Control
#define Reserved                      0x00040000      // 
#define Reserved                      0x001E0000      // 
#define UART3                         0x00002000      // UART3 Clock Gate Control
#define UART2                         0x00001000      // UART2 Clock Gate Control
#define UART1                         0x00000800      // UART1 Clock Gate Control
#define UART0                         0x00000400      // UART0 Clock Gate Control
#define Reserved                      0x00000600      // 
#define I2C1                          0x00000080      // I2C1 Clock Gate Control
#define I2C0                          0x00000040      // I2C0 Clock Gate Control
#define Reserved                      0x00000060      // 
#define CMT                           0x00000008      // CMT Clock Gate Control
#define EWM                           0x00000004      // EWM Clock Gate Control
#define Reserved                      0x00000002      // 
#define Reserved                      0x00000001      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

#define Reserved                      0xFFF80000000      // 
#define Reserved                      0x00040000      // 
#define Reserved                      0x001E0000      // 
#define PORTE                         0x00002000      // Port E Clock Gate Control
#define PORTD                         0x00001000      // Port D Clock Gate Control
#define PORTC                         0x00000800      // Port C Clock Gate Control
#define PORTB                         0x00000400      // Port B Clock Gate Control
#define PORTA                         0x00000200      // Port A Clock Gate Control
#define Reserved                      0x00000300      // 
#define Reserved                      0x00000040      // 
#define Reserved                      0x000001E0      // 
#define Reserved                      0x00000002      // 
#define LPTIMER                       0x00000001      // Low Power Timer Access Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC6 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // 
#define Reserved                      0x40000000      // 
#define RTC                           0x20000000      // RTC Access Control
#define Reserved                      0x10000000      // 
#define ADC0                          0x08000000      // ADC0 Clock Gate Control
#define Reserved                      0x04000000      // 
#define FTM1                          0x02000000      // FTM1 Clock Gate Control
#define FTM0                          0x01000000      // FTM0 Clock Gate Control
#define PIT                           0x00800000      // PIT Clock Gate Control
#define PDB                           0x00400000      // PDB Clock Gate Control
#define Reserved                      0x00200000      // 
#define Reserved                      0x00300000      // 
#define CRC                           0x00040000      // CRC Clock Gate Control
#define Reserved                      0x00060000      // 
#define I2S                           0x00008000      // I2S Clock Gate Control
#define Reserved                      0x00004000      // 
#define SPI1                          0x00002000      // SPI1 Clock Gate Control
#define SPI0                          0x00001000      // SPI0 Clock Gate Control
#define Reserved                      0x00001800      // 
#define Reserved                      0x00000200      // 
#define Reserved                      0x00000F00      // 
#define FLEXCAN0                      0x00000010      // FlexCAN0 Clock Gate Control
#define Reserved                      0x00000018      // 
#define DMAMUX                        0x00000002      // DMA Mux Clock Gate Control
#define FTFL                          0x00000001      // Flash Memory Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC7 register.
//
//*****************************************************************************

#define Reserved                      0xFFFFFFF80000000      // 
#define Reserved                      0x00000004      // 
#define DMA                           0x00000002      // DMA Clock Gate Control
#define FLEXBUS                       0x00000001      // FlexBus Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV1 register.
//
//*****************************************************************************

#define OUTDIV1                       0x780000000      // Clock 1 output divider value
#define OUTDIV2                       0x78000000      // Clock 2 output divider value
#define OUTDIV3                       0x07800000      // Clock 3 output divider value
#define OUTDIV4                       0x00780000      // Clock 4 output divider value
#define Reserved                      0x7FFF8000      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_CLKDIV2 register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFF80000000      // 
#define Reserved                      0x00000038      // 
#define Reserved                      0x00000001      // 


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG1 register.
//
//*****************************************************************************

#define NVMSIZE                       0x780000000      // FlexNVM size
#define PFSIZE                        0x78000000      // Program flash size
#define Reserved                      0x07800000      // 
#define EESIZE                        0x00780000      // EEPROM size
#define Reserved                      0x00078000      // 
#define DEPART                        0x00007800      // FlexNVM partition
#define Reserved                      0x00001F80      // 
#define FLASHDOZE                     0x00000002      // Flash Doze
#define FLASHDIS                      0x00000001      // Flash Disable
#define EESIZE                        0x00780000      // EEPROM size
#define DEPART                        0x00007800      // FlexNVM partition


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_FCFG2 register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // 
#define MAXADDR0                      0x1FC0000000      // Max address block 0
#define PFLSH                         0x00800000      // Program flash
#define MAXADDR1                      0x1FC00000      // Max address block 1
#define Reserved                      0x7FFF8000      // 
#define MAXADDR0                      0x1FC0000000      // Max address block 0
#define MAXADDR1                      0x1FC00000      // Max address block 1


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification
#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDMH register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification
#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDML register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification
#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_UIDL register.
//
//*****************************************************************************

#define UID                           0x7FFFFFFF80000000      // Unique Identification ::
#define UID                           0x7FFFFFFF80000000      // Unique Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the RCM_SRS1 register.
//
//*****************************************************************************

